module.exports = {
  login: 'Логин',

  password: 'Пароль',
  repeatPassword: 'Повторите пароль',
  email: 'Адрес электронной почты',
  submit: 'Направить',
  cancel: 'Отменить',

  signInGoogle: 'Войти с Google',
  signInFRA: 'Войти с ОЛР',

  changePassword: 'Изменить пароль',
  expired: 'Похоже, ссылка, на которую вы щелкнули, просрочена или недействительна',

  forgotPasswordTitle: 'Введите свою электронную почту и отправьте форму для получения инструкций по электронной почте',
  forgotPassword: 'Забыли пароль?',

  notAuthorized: 'Пользователь не авторизован',
  errorOccurred: 'Произошла ошибка',
  noInvitation: 'Приглашение не найдено',
  noMatchPasswords: 'Пароли не совпадают',
  noEmptyPassword: 'Пароль не может быть пустым',
  noMatchingUser:
    'Мы не смогли найти ни одного пользователя, соответствующего этим учетным данным. Убедитесь, что у вас есть действующая учетная запись ОЛР.',
  noMatchingEmail:
    'Мы не смогли найти ни одного пользователя, соответствующего этому адресу электронной почты. Убедитесь, что у вас есть действующая учетная запись ОЛР.',
  passwordError:
    'Пароль должен состоять из шести или более символов и содержать как минимум один нижний регистр, один буквенный символ верхнего регистра и одну цифру.',
  invalidEmail: 'Электронная почта недействительна',
  emptyEmail: 'Электронная почта не может быть пустой',
  noLongerValid: 'Похоже, ваш запрос больше не действителен.',

  passwordResetSent:
    'Запрос на сброс пароля был успешно отправлен. Вскоре вы получите электронное письмо с инструкциями',
  passwordChanged: 'Пароль был изменен',
  missingCredentials: 'Отсутствующие учетные данные',
}
