import { CycleNames } from 'meta/assessment/cycle/names'

import type { GetReadmeTemplate, ReadmeYearsByCycle } from '../types'

const readmeYearsByCycle: ReadmeYearsByCycle = {
  [CycleNames._2020]: {
    yearRange: '1990-2000، 2000-2010، 2010-2015 أو 2015-2020',
    years: '1990، 2000، 2010، 2015 و2020',
  },
  [CycleNames._2025]: {
    yearRange: '1990-2000، 2000-2010، 2010-2015، 2015-2020 أو 2020-2025',
    years: '1990، 2000، 2010، 2015، 2020 و2025',
  },
}

export const getReadmeAr: GetReadmeTemplate = (props) => {
  const { cycleName } = props
  const { yearRange, years } = readmeYearsByCycle[cycleName]

  return `README

تحتوي حزمة التنزيل المجمّع بصيغة ZIP على ثلاثة مجلدات:

“Annual_variables”، يحتوي هذا المجلد على بيانات سنوية حول اضطرابات الغابات حسب المتغير (الأمراض، الحشرات، الأحوال الجوية، عوامل أخرى، والحرائق). يتم تنظيم البيانات على شكل أعمدة سنوية، وهي متاحة للفترة من عام 2000 وحتى أحدث سنة إبلاغ. يتم تسمية كل ملف وفقًا لبنية تقارير FRA:
[Section][SubSection]_[variable]_[yyyy]-[mm]-[dd].csv.
يشير مكوّن التاريخ إلى تاريخ تنزيل البيانات هنا وفي أماكن أخرى من هذا المستند.

“FRA_Years_variables”، توجد معظم البيانات المُبلَّغ عنها في هذا المجلد، وعادةً ما يتم تنظيم البيانات في ملفات منفصلة لكل متغير. يحتوي كل ملف عادةً على أعمدة منفصلة لسنوات الإبلاغ الخاصة بـ FRA: ${years}. يتم تسمية الملفات وفقًا للاصطلاح التالي:
[Section][SubSection]_[variable]_[yyyy]-[mm]-[dd].csv

“Intervals_variables”، يحتوي هذا المجلد على ملفات منفصلة لبيانات متوسط التغير السنوي المتعلقة بتوسّع الغابات، والتشجير، والتوسّع الطبيعي، وإزالة الغابات، وإعادة التشجير. يحتوي كل سجل بيانات على معلومات تخص بلدًا واحدًا وفترات زمنية هي:
${yearRange}. يتم تسمية كل ملف وفقًا للاصطلاح التالي:
[Section][SubSection]_[variable]_[yyyy]-[mm]-[dd].csv

بالإضافة إلى المجلدات الفرعية، يحتوي التنزيل المجمّع على عدد من الملفات:

الملف “Annual_[yyyy]-[mm]-[dd].csv” يحتوي على البيانات في ورقة Excel واحدة لجميع المتغيرات الموجودة في مجلد “Annual_variables”. بالإضافة إلى ذلك، يحتوي هذا الملف على رموز حالة الملاحظات (“flags”) لكل نقطة بيانات. يمكن العثور على وصف هذه الرموز في العمود U.

الملف “DegradedForest_[yyyy]-[mm]-[dd].csv” يحتوي على بيانات وصفية مُبلَّغ عنها حول الغابات المتدهورة.

الملف “ForestPolicy_[yyyy]-[mm]-[dd].csv” يحتوي على بيانات وصفية مُبلَّغ عنها حول السياسة الحرجية.

الملف “ForestRestoration_[yyyy]-[mm]-[dd].csv” يحتوي على بيانات وصفية مُبلَّغ عنها حول استعادة الغابات.

الملف “FRA_years_[yyyy]-[mm]-[dd].csv” يحتوي على البيانات في ورقة Excel واحدة لجميع المتغيرات الموجودة في مجلد “FRA_Years_variables”. بالإضافة إلى ذلك، يحتوي هذا الملف على “flags” لكل نقطة بيانات؛ يمكن العثور على وصف هذه الرموز في العمود IA.

الملف “Intervals_[yyyy]-[mm]-[dd].csv” يحتوي على البيانات في ورقة Excel واحدة لجميع المتغيرات الموجودة في مجلد “Intervals_variables”. بالإضافة إلى ذلك، يحتوي هذا الملف على “flags” لكل نقطة بيانات؛ يمكن العثور على وصف هذه الرموز في العمود Q.

الملف “NDPYear_[yyyy]-[mm]-[dd].csv” يحتوي على بيانات عن أقدم وأحدث سنة من “نقطة البيانات الوطنية” (National Data Point) المستخدمة من قبل البلدان/المناطق التي تعتمد هذا النهج في الإبلاغ عن مساحة الغابات.

الملف “NWFP_[yyyy]-[mm]-[dd].csv” يحتوي على بيانات عن أهم 10 منتجات حرجية غير خشبية (NWFP) كما تم الإبلاغ عنها، وتشمل: الاسم، والقيمة بوحدة آلاف العملة المحلية، وفئات منتجات الغابات غير الخشبية (للمزيد من المعلومات حول الفئات المختلفة، يرجى الرجوع إلى منصة FRA، الجدول 7).

الملف “Tiers_[yyyy]-[mm]-[dd].csv” يحتوي على معلومات حول المستويات (“Tiers”) المُبلَّغ عنها للجداول التالية:
الجدول 1a: مساحة الغابات (الحالة والاتجاه)،
الجدول 2a: المخزون القائم (الحالة)،
الجدول 2c: مخزون الكتلة الحيوية (الحالة).
للمزيد من المعلومات حول معايير المستويات المختلفة، يرجى الرجوع إلى أقسام معايير المستويات في منصة FRA للجداول 1a و2a و2c.

يمكن العثور على وحدات الإبلاغ في كل ملف من الملفات أو على منصة FRA.

ا منظمة الأغذية والزراعة (الفاو). سنة التنزيل. تقييم الموارد الحرجية العالمية. الرابط. تم الوصول إليه في : تاريخ التنزيل

جهة الاتصال: fra@fao.org`
}
