module.exports = {
  login: 'تسجيل دخول',

  password: 'كلمة مرور',
  repeatPassword: 'كرر كلمة المرور',
  email: 'البريد الإلكتروني',
  submit: 'تقديم',
  cancel: 'إلغاء',

  signInGoogle: 'تسجيل دخول عن طريق جوجل',
  signInFRA: 'تسجيل دخول عن طريق منصة تقييم الموارد الحرجية',

  changePassword: 'تغيير كلمة المرور',
  expired: 'للأسف يبدو أن الرابط الذي قمت بالنقر عليه قد انتهت صلاحيته أو لم يعد سارياً',

  forgotPasswordTitle: 'أدخل عنوان بريدك الإلكتروني وقدّم الاستمارة كي تتلقى التعليمات عن طريق البريد الإلكتروني',
  forgotPassword: 'هل نسيت كلمة المرور؟',

  notAuthorized: 'المستخدم غير مخوّل للدخول',
  errorOccurred: 'حدث خطأ',
  noInvitation: 'لم يُعثر على دعوة',
  noMatchPasswords: 'كلمة المرور غير مطابقة',
  noEmptyPassword: 'لا يمكنك ترك حيّز كلمة المرور خالياً',
  noMatchingUser: 'لم نعثر على أي مستخدم مطابق لهذه الاعتمادات.',
  noMatchingEmail: 'لم نعثر على أي مستخدم مطابق لهذا البريد الإلكتروني.',
  passwordError: 'يجب أن تشتمل كلمة المرور على ستة رموز أو أكثر، منها حرف كبير واحد وآخر صغير ورقم على الأقل',
  invalidEmail: 'البريد الإلكتروني غير سارٍ',
  emptyEmail: 'لا يمكنك ترك حيّز البريد الإلكتروني خالياً',
  noLongerValid: 'للأسف يبدو أن طلبكم لم يعد سارياً.',

  passwordResetSent: 'تم تقديم طلب إعادة ضبط كلمة المرور بنجاح.',
  passwordChanged: 'تم تغيير كلمة المرور',
  missingCredentials: 'أوراق اعتماد ناقصة',
}
